getAgreementDetail() {
    return (
        <div className="App">

            <section>
                <h2>九、违约责任</h2>
                <p>
                    <span className="bold">9.1 违约定义：</span>
                    各方中的任何一方违反本协议中所做约定的义务，均构成违约。
                </p>
                <p>
                    <span className="bold">9.2 甲方违约情形：</span>
                    甲方有下列情形之一的，乙方有权单方面解除本协议并要求甲方承担相关赔偿责任：
                </p>
                <p>
                    <span className="indented">(1) 直接或间接参与欺诈，或在网上买卖POS机（包括MPOS）、刷卡器等受理终端，或涉嫌实施其他违法犯罪活动的；</span>
                    <br />
                    <span className="indented">(2) 经营及财务状况恶化无法正常经营，或被全国企业信用信息公示系统列入"严重违法失信企业名单"，或单位注册地址不存在或者虚构经营场所的；</span>
                    <br />
                    <span className="indented">(3) 甲方或其法定代表人、负责人被中国支付清算协会、清算机构、其他国家机关、企事业单位列入黑名单，或存在被国家机关、行业协会的处罚记录的；</span>
                    <br />
                    <span className="indented">(4) 实施违规操作，或违反本协议或相关补充协议等约定，且经指出拒不改正或在合理期间内虽有改正但无法达到乙方整改要求和目标的；</span>
                    <br />
                    <span className="indented">(5) 无理拒绝或故意拖延乙方交易查询、调单查询或监查要求的；</span>
                    <br />
                    <span className="indented">(6) 进入破产程序、解散、营业执照被吊销；</span>
                    <br />
                    <span className="indented">(7) 实施有损乙方或携程利益行为的；</span>
                    <br />
                    <span className="indented">(8) 违反本协议或利用乙方提供的服务从事非法业务的；</span>
                    <br />
                    <span className="indented">(9) 甲方的软硬件系统存在安全问题，经乙方通知后拒不整改的；</span>
                    <br />
                    <span className="indented">(10) 出现风险事件或经乙方判断交易异常的；</span>
                    <br />
                    <span className="indented">(11) 违反乙方的相关规则和制度的。</span>
                </p>
            </section>

            <section>
                <h2>十、免责条款</h2>
                <p>
                    <span className="bold">10.1 乙方免责情形：</span>
                    因下列原因导致乙方无法正常提供服务，乙方不承担任何责任：
                </p>
                <p>
                    <span className="indented">(1) 乙方系统停机维护或升级；</span>
                    <br />
                    <span className="indented">(2) 因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；</span>
                    <br />
                    <span className="indented">(3) 用户的电脑软硬件和通信线路、供电线路出现故障的；</span>
                    <br />
                    <span className="indented">(4) 用户操作不当或通过非乙方授权或认可的方式使用乙方服务的；</span>
                    <br />
                    <span className="indented">(5) 因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因。</span>
                </p>
                <p>尽管有前款约定，乙方将采取合理行动积极促使服务恢复正常。</p>
                <p>
                    <span className="bold">10.2 利益冲突豁免：</span>
                    乙方可能同时为甲方及甲方的（交易）对手方提供本服务，甲方同意对乙方可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张乙方在提供本服务时存在法律上的瑕疵。
                </p>
            </section>

            <section>
                <h2>十一、风险提示及特别约定</h2>
                <p>
                    <span className="bold">11.1 风险认知：</span>
                    双方对于开展电子商务业务存在的风险性均完全知悉，双方均承诺采取合理的风险防范措施，以尽量避免或减小风险。
                </p>
                <p>
                    <span className="bold">11.2 风险防范：</span>
                    本服务交易过程中，甲方应积极防范银行卡持卡人拒付风险，及时解决交易中出现的问题：
                </p>
                <p>
                    <span className="indented">(1) 若在交易中如出现包括但不限于交易不真实、欺诈、伪冒交易、持卡人账户信息泄漏或甲方违反国家法律规定或甲方违反对用户的承诺以及甲方违反与乙方的约定之情形，甲方应自行承担上述情形造成的全部损失；</span>
                    <br />
                    <span className="indented">(2) 若在交易中如出现持卡人否认交易、持卡人拒付、集中转入分散转出等可疑情形的，甲方应依据本协议第4.7条之要求向乙方提供相应的交易凭证，若甲方怠于提供凭证，或甲方提供的凭证不符合相关行业内标准，或在乙方书面通知（含电子邮件通知）后甲方未及时停止可疑交易、控制相应资金的等，甲方应自行承担上述情形造成的全部损失。</span>
                </p>
                <p>甲方因上述情形给乙方造成损失的，乙方有权直接从甲方的待结算款项中扣收或暂缓交易资金结算要求甲方支付相应资金，仍不足以赔偿的，可以继续向甲方追偿。</p>
                <p>
                    <span className="bold">11.3 合规要求：</span>
                    甲方在进行支付交易的过程中，应严格遵守中国人民银行网上银行业务和信用卡交易相关的政策法规，不得进行虚假交易、非法套现、洗钱等行为。甲方不得直接或变相从事互联网赌博、色情平台，互联网销售彩票平台，非法外汇、贵金属投资交易平台，非法证券期货类交易平台，代币发行融资及虚拟货币交易平台，也不得未经监管部门批准通过互联网开展资产管理业务以及未取得省级政府批文的大宗商品交易场所等非法交易，否则乙方有权终止为其提供支付结算服务。
                </p>
            </section>

            <section>
                <h2>十二、知识产权</h2>
                <p>
                    <span className="bold">12.1 乙方知识产权：</span>
                    乙方在本合作中提供的内容（包括但不限于商标、标识、网页、文字、图片等）的知识产权归乙方所有。
                </p>
                <p>
                    <span className="bold">12.2 软件系统知识产权：</span>
                    除另有特别声明外，乙方在本合作中提供的软件系统、技术接口、安全证书等所依托的著作权、专利权及其他知识产权均归乙方所有。
                </p>
                <p>
                    <span className="bold">12.3 知识产权保护：</span>
                    上述知识产权均受到法律保护，未经乙方或相关权利人许可，不得以任何形式进行使用或创造相关衍生作品。
                </p>
                <p>
                    <span className="bold">12.4 乙方标识保护：</span>
                    乙方对带有乙方字样、标识、logo、图片等信息的物料、宣传资料和扫码设备享有知识产权，甲方不得在经营场所实施或协助、放任他人实施替换、遮盖、涂抹、藏匿、毁坏带有乙方字样、标识、logo、图片等信息的物料、宣传资料和扫码设备的行为，否则，甲方应按照乙方的要求恢复原状、赔偿损失。乙方有权要求甲方在使用乙方时按照乙方的要求正确展示乙方字样、标识、logo、图片等信息，如甲方未进行正确展示，乙方有权要求甲方限期纠正，若甲方不按期纠正，乙方有权对甲方采取包括但不限于提高支付手续费率、限制商户号部分或全部功能等措施。
                </p>
            </section>

            <section>
                <h2>十三、适用法律及争议解决</h2>
                <p>
                    <span className="bold">13.1 适用法律：</span>
                    本协议之解释、适用、争议解决等一切事宜，均适用中华人民共和国大陆地区法律（仅为本协议之目的，为避免疑义，不包括香港特别行政区、澳门特别行政区及台湾地区法律）。
                </p>
                <p>
                    <span className="bold">13.2 争议解决：</span>
                    因本协议产生的争议，应协商解决。协商不成的，任何一方均可向上海市长宁区人民法院提起诉讼。
                </p>
                <p>
                    <span className="bold">13.3 小额诉讼：</span>
                    对于本协议有关的任何争议，双方知晓并完全同意对事实清楚、权利义务关系明确、争议不大、标的额为人民币五万元以上、十万元以下的简单金钱给付类案件，适用小额诉讼程序，实行一审终审。适用小额诉讼程序审理的案件，审判组织、审理期限、审理方式、一审终审等相关事项以最高人民法院颁布的《民事诉讼程序繁简分流改革试点实施办法》为准。
                </p>
            </section>

            <section>
                <h2>十四、协议有效期、自动续期、提前终止协议和变更协议</h2>
                <p>
                    <span className="bold">14.1 协议有效期及续期：</span>
                    本协议自双方盖章之日起生效，有效期两年。若各方均未在有效期届满前一个月以书面形式通知解约，且双方在协议有效期内均未提出费率变更请求，则本协议自动续期一年，续期次数不限。如甲方与携程的业务合作协议早于本协议终止，乙方有权提前终止本协议。除本协议5.3条约定之情形外，若乙方在协议有效期内提出费率变更请求，并以电子邮件或其他信息通知等形式通知甲方，自信息发出之日起30日内，甲方继续使用本服务的，乙方有权自30日届满之日起按照变更后的费率向甲方收取手续费。
                </p>
                <p>
                    <span className="bold">14.2 提前终止：</span>
                    各方有权基于各自的营运需要提前终止本协议，且无需承担任何法律责任。需提前终止本协议的，主动提出方应提前一个月以书面或电子邮件形式通知各方。
                </p>
                <p>
                    <span className="bold">14.3 终止后效力：</span>
                    协议解除或终止后，涉及到退款和保密的条款依然有效，各方应继续遵照执行。
                </p>
                <p>
                    <span className="bold">14.4 协议修订：</span>
                    因国家法律法规变化、市场发展等情况，乙方可能修订本协议。乙方将通过电子邮件、平台信息或网站等方式提前30日向甲方公布修订后的协议。如甲方不同意乙方对本协议的修订，甲方可以立即以书面的方式通知乙方终止为甲方提供服务，甲方继续使用服务即表示甲方接受经修订的协议。
                </p>
                <p>
                    <span className="bold">14.5 协议份数：</span>
                    本协议一式贰份，双方各执壹份，具有同等法律效力。
                </p>
            </section>

            <section>
                <h2>十五、新增商户号或变更商户信息</h2>
                <p>
                    甲方如需新增商户号或变更商户信息（包括但不限于工商注册名称、主营业务、经营范围、法定代表人或主要负责人

                </p>
                </section>
        </div>
    )
}